
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY
  * module.fpl-action-group.azurerm_resource_group_template_deployment.action-group
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "aba551ce-87b5-4632-a8b9-f3d07a298fba" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/components/fpl-case-service-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "fpl-case-service-appinsights-aat"
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
            "application"         = "family-public-law"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#fpla-tech"
            "environment"         = "staging"
            "managedBy"           = "Family Public Law"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSGHTS_KEY" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/a771525c377349a98785c2d96a6b3acc"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fpl-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Resources/deployments/fpl-support"
        name                     = "fpl-support"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat|fpl-aat"
        name                       = "fpl-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat|fpl-aat"
        name                       = "fpl-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":4280,"Program":"tfcmt","SHA1":"","Vars":{}} -->